Reports/ОМГ_ПродажаПоНоменклатуре.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Report>
		<Properties>
			<Name>ОМГ_ПродажаПоНоменклатуре</Name>
		</Properties>
	</Report>
</MetaDataObject>

InformationRegisters/омг_НоменклатураЗаявок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>омг_НоменклатураЗаявок</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокРегистрации</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ОказаниеУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.Заявка</v8:Type>
						<v8:Type>cfg:DocumentRef.Прием</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Врач</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УникНомерСтрокиЗаявка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Филиал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>омг_СтраховаяПрограмма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СоглашенияСтрахования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/омг_НоменклатураОказанияУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>омг_НоменклатураОказанияУслуг</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВОказании</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокРегистрации</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ОказаниеУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.Заявка</v8:Type>
						<v8:Type>cfg:DocumentRef.Прием</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Врач</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УникНомерСтрокиОказание</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Филиал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>омг_СтраховаяПрограмма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СоглашенияСтрахования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/омг_НоменклатураПриема.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>омг_НоменклатураПриема</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокРегистрации</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ОказаниеУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.Заявка</v8:Type>
						<v8:Type>cfg:DocumentRef.Прием</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Врач</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УникНомерСтрокиПрием</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Филиал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>омг_СтраховаяПрограмма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СоглашенияСтрахования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Reports/ОМГ_ПродажаПоНоменклатуре/Ext/ObjectModule.bsl
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	КомпоновщикНастроек.ЗагрузитьНастройки(КомпоновщикНастроек.ПолучитьНастройки());
	Параметры = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы;
	Период = Параметры.Найти("Период").Значение;
	НачалоПериода = Период.ДатаНачала;
	КонецПериода = Период.ДатаОкончания;
	
	//Получаем данные для печати
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНачала",НачалоПериода);
	Запрос.УстановитьПараметр("ДатаОкончания",КонецПериода);    
	ГруппаИсключения = Параметры.Найти("ГруппаИсключения").Значение;
	ИспользованиеГруппы = Ложь;
	Если ЗначениеЗаполнено(ГруппаИсключения) Тогда 
		ИспользованиеГруппы = Параметры.Найти("ГруппаИсключения").Использование;
		Запрос.УстановитьПараметр("ЛабИследования",ГруппаИсключения); 
	КонецЕсли;
	Запрос.Текст = ПолучитьТекстЗапроса(ГруппаИсключения,ИспользованиеГруппы);
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	ВыборкаЗаявки = РезультатЗапроса[0].Выбрать();
	ТабОказания = РезультатЗапроса[1].Выгрузить(); 
	ТабПриемы = РезультатЗапроса[2].Выгрузить();
	
	// Заполняем табличный документ	
	ТабДок = Новый ТабличныйДокумент;
	Макет = ПолучитьМакет("Макет");
	
	ОбластьШапка = Макет.ПолучитьОбласть("ОбластьШапка");
	ОбластьСтрока = Макет.ПолучитьОбласть("ОбластьСтрока");
	ОбластьПодвал = Макет.ПолучитьОбласть("ОбластьПодвал");
	
	//ОбластьШапка.Параметры.ДатаПриказа = Формат(ТекущаяДата(),"ДФ='dd.MM.yyyy'");
	ТабДок.Вывести(ОбластьШапка);
	
	i=0;
	Пока ВыборкаЗаявки.Следующий() Цикл
		i=i+1;
		ОбластьСтрока.Параметры.Заполнить(ВыборкаЗаявки);
		ОбластьСтрока.Параметры.нпп = i; 		
		КоличествоОказания = 0;
		КоличествоПрием    = 0;
		СтрПоиска = Новый Структура();
		СтрПоиска.Вставить("Номенклатура",ВыборкаЗаявки.Номенклатура);
		СтрПоиска.Вставить("Клиент",ВыборкаЗаявки.Клиент);
		СтрПоиска.Вставить("Врач",ВыборкаЗаявки.Врач);
		СтрПоиска.Вставить("Филиал",ВыборкаЗаявки.Филиал);
		СтрПоиска.Вставить("омг_СтраховаяПрограмма",ВыборкаЗаявки.омг_СтраховаяПрограмма);
		СтрПоиска.Вставить("РегистраторДокументОснование",ВыборкаЗаявки.РегистраторСсылка);		
		// Ищем по Оказаниям 
		НайдСтрокиОказания = ТабОказания.НайтиСтроки(СтрПоиска); 
		Если НайдСтрокиОказания.Количество() > 0 Тогда
			
			КоличествоЗаявки = ВыборкаЗаявки.КоличествоЗаявки;
			Для каждого строка из НайдСтрокиОказания Цикл
				Если КоличествоЗаявки > 0 и строка.Количество > 0 Тогда
					Если строка.Количество = КоличествоЗаявки Тогда 
						КоличествоОказания = КоличествоЗаявки;
						строка.Количество = 0;
						строка.Исп = Истина;
						КоличествоЗаявки = 0; 
					ИначеЕсли строка.Количество > КоличествоЗаявки Тогда
						КоличествоОказания = КоличествоЗаявки;
						строка.Количество = строка.Количество - КоличествоЗаявки;
						КоличествоЗаявки = 0;
					иначе 
						КоличествоОказания = КоличествоОказания + строка.Количество;
						КоличествоЗаявки = КоличествоЗаявки - строка.Количество;
						строка.Количество = 0;
						строка.Исп = Истина;
					КонецЕсли;	
				КонецЕсли;	
			КонецЦикла;	
			
		КонецЕсли;
		ОбластьСтрока.Параметры.КоличествоОказания = КоличествоОказания;  
		// Ищем по Приемам 
		НайдСтрокиПриема = ТабПриемы.НайтиСтроки(СтрПоиска); 
		Если НайдСтрокиПриема.Количество() > 0 Тогда
			
			КоличествоЗаявки = ВыборкаЗаявки.КоличествоЗаявки;
			Для каждого строка из НайдСтрокиПриема Цикл
				Если КоличествоЗаявки > 0 и строка.Количество > 0 Тогда
					Если строка.Количество = КоличествоЗаявки Тогда 
						КоличествоПрием = КоличествоЗаявки;
						строка.Количество = 0;
						строка.Исп = Истина;
						КоличествоЗаявки = 0; 
					ИначеЕсли строка.Количество > КоличествоЗаявки Тогда
						КоличествоПрием = КоличествоЗаявки;
						строка.Количество = строка.Количество - КоличествоЗаявки;
						КоличествоЗаявки = 0;
					иначе 
						КоличествоПрием = КоличествоПрием + строка.Количество;
						КоличествоЗаявки = КоличествоЗаявки - строка.Количество;
						строка.Количество = 0; 
						строка.Исп = Истина;
					КонецЕсли;	
				КонецЕсли;	
			КонецЦикла;	
			
		КонецЕсли;
		ОбластьСтрока.Параметры.КоличествоПрием = КоличествоПрием; 	
		ТабДок.Вывести(ОбластьСтрока);
	КонецЦикла;
	СтрПоиска = Новый Структура();
	СтрПоиска.Вставить("Исп",Ложь);  
	// Ищем по Не использованные строки Оказания 
	НайдСтрокиОказания = ТабОказания.НайтиСтроки(СтрПоиска); 
	Если НайдСтрокиОказания.Количество() > 0 Тогда
		Для каждого строка из НайдСтрокиОказания Цикл
			Если строка.Количество > 0 Тогда   
				i=i+1;
				ОбластьСтрока.Параметры.Заполнить(строка);
				ОбластьСтрока.Параметры.нпп = i;
				ОбластьСтрока.Параметры.КоличествоЗаявки = "";
				ОбластьСтрока.Параметры.КоличествоПрием = "";
				ОбластьСтрока.Параметры.КоличествоОказания = строка.Количество;
				// дополняем из приемов 
				КоличествоПрием = 0;
				СтрПоиска2 = Новый Структура();
				СтрПоиска2.Вставить("Исп",Ложь); 
				СтрПоиска2.Вставить("РегистраторДокументОснование",строка.РегистраторДокументОснование); 
				СтрПоиска2.Вставить("Номенклатура",строка.Номенклатура);
				СтрПоиска2.Вставить("Клиент",строка.Клиент);
				СтрПоиска2.Вставить("Врач",строка.Врач);
				СтрПоиска2.Вставить("Филиал",строка.Филиал);
				СтрПоиска2.Вставить("омг_СтраховаяПрограмма",строка.омг_СтраховаяПрограмма);	
				НайдСтрокиПриема = ТабПриемы.НайтиСтроки(СтрПоиска2); 
				Если НайдСтрокиПриема.Количество() > 0 Тогда
					Для каждого строкаПрием из НайдСтрокиПриема Цикл
						Если строкаПрием.Количество > 0 Тогда 
							КоличествоПрием = КоличествоПрием + строкаПрием.Количество;
							строкаПрием.Количество = 0;
							строкаПрием.Исп = Истина;
						КонецЕсли;	
					КонецЦикла;	
				КонецЕсли;
				ОбластьСтрока.Параметры.КоличествоПрием = КоличествоПрием;
				ТабДок.Вывести(ОбластьСтрока);
			КонецЕсли;	
		КонецЦикла;	
	КонецЕсли;	
	// Ищем по Не использованные строки Приема 
	НайдСтрокиПриема = ТабПриемы.НайтиСтроки(СтрПоиска); 
	Если НайдСтрокиПриема.Количество() > 0 Тогда
		Для каждого строка из НайдСтрокиПриема Цикл
			Если строка.Количество > 0 Тогда   
				i=i+1;
				ОбластьСтрока.Параметры.Заполнить(строка);
				ОбластьСтрока.Параметры.нпп = i;  
				ОбластьСтрока.Параметры.КоличествоОказания = "";
				ОбластьСтрока.Параметры.КоличествоЗаявки = "";
				ОбластьСтрока.Параметры.КоличествоПрием = строка.Количество;
				ТабДок.Вывести(ОбластьСтрока);
			КонецЕсли;	
		КонецЦикла;	
	КонецЕсли;
	//ТабДок.Вывести(ОбластьПодвал);
	
	ДокументРезультат.Очистить();
	ДокументРезультат.Вывести(ТабДок);    
	
КонецПроцедуры	

Функция ПолучитьТекстЗапроса(ГруппаИсключения = Неопределено,ИспользованиеГруппы)   
	ТекстДопУсловий = "";
	Если ЗначениеЗаполнено(ГруппаИсключения) и ИспользованиеГруппы Тогда
		
		ТекстДопУсловий1 = "
		|	И НЕ омг_НоменклатураЗаявок.Номенклатура В ИЕРАРХИИ (&ЛабИследования)
		|"; 
		ТекстДопУсловий2 = "
		|	И НЕ омг_НоменклатураОказанияУслуг.Номенклатура В ИЕРАРХИИ (&ЛабИследования)
		|";
		ТекстДопУсловий3 = "
		|	И НЕ омг_НоменклатураПриема.Номенклатура В ИЕРАРХИИ (&ЛабИследования)
		|"; 		 
	КонецЕсли;	
	
	Текст = 
	"ВЫБРАТЬ
	|	омг_НоменклатураЗаявок.Регистратор.Ссылка КАК РегистраторСсылка,
	|	омг_НоменклатураЗаявок.Номенклатура КАК Номенклатура,
	|	омг_НоменклатураЗаявок.Клиент КАК Клиент,
	|	омг_НоменклатураЗаявок.Врач КАК Врач,
	|	омг_НоменклатураЗаявок.Филиал КАК Филиал,
	|	омг_НоменклатураЗаявок.омг_СтраховаяПрограмма КАК омг_СтраховаяПрограмма,
	|	СУММА(омг_НоменклатураЗаявок.Количество) КАК КоличествоЗаявки
	|ИЗ
	|	РегистрСведений.омг_НоменклатураЗаявок КАК омг_НоменклатураЗаявок
	|ГДЕ
	|	омг_НоменклатураЗаявок.ДатаРегистрации МЕЖДУ &ДатаНачала И &ДатаОкончания"
	+ТекстДопУсловий1+
	"
	|СГРУППИРОВАТЬ ПО
	|	омг_НоменклатураЗаявок.омг_СтраховаяПрограмма,
	|	омг_НоменклатураЗаявок.Регистратор.Ссылка,
	|	омг_НоменклатураЗаявок.Филиал,
	|	омг_НоменклатураЗаявок.Клиент,
	|	омг_НоменклатураЗаявок.Врач,
	|	омг_НоменклатураЗаявок.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	омг_НоменклатураОказанияУслуг.Регистратор.Ссылка КАК РегистраторСсылка,
	|	омг_НоменклатураОказанияУслуг.Номенклатура КАК Номенклатура,
	|	омг_НоменклатураОказанияУслуг.Клиент КАК Клиент,
	|	омг_НоменклатураОказанияУслуг.Врач КАК Врач,
	|	омг_НоменклатураОказанияУслуг.Филиал КАК Филиал,
	|	омг_НоменклатураОказанияУслуг.омг_СтраховаяПрограмма КАК омг_СтраховаяПрограмма,
	|	СУММА(омг_НоменклатураОказанияУслуг.Количество) КАК Количество,
	|	омг_НоменклатураОказанияУслуг.Регистратор.ДокументОснование КАК РегистраторДокументОснование,
	|	ЛОЖЬ КАК Исп
	|ИЗ
	|	РегистрСведений.омг_НоменклатураОказанияУслуг КАК омг_НоменклатураОказанияУслуг
	|ГДЕ
	|	омг_НоменклатураОказанияУслуг.ДатаРегистрации МЕЖДУ &ДатаНачала И &ДатаОкончания"
	+ТекстДопУсловий2+
	"
	|СГРУППИРОВАТЬ ПО
	|	омг_НоменклатураОказанияУслуг.Клиент,
	|	омг_НоменклатураОказанияУслуг.омг_СтраховаяПрограмма,
	|	омг_НоменклатураОказанияУслуг.Регистратор.Ссылка,
	|	омг_НоменклатураОказанияУслуг.Филиал,
	|	омг_НоменклатураОказанияУслуг.Врач,
	|	омг_НоменклатураОказанияУслуг.Номенклатура,
	|	омг_НоменклатураОказанияУслуг.Регистратор.ДокументОснование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	омг_НоменклатураПриема.Регистратор.Ссылка КАК РегистраторСсылка,
	|	омг_НоменклатураПриема.Номенклатура КАК Номенклатура,
	|	омг_НоменклатураПриема.Клиент КАК Клиент,
	|	омг_НоменклатураПриема.Врач КАК Врач,
	|	омг_НоменклатураПриема.Филиал КАК Филиал,
	|	омг_НоменклатураПриема.омг_СтраховаяПрограмма КАК омг_СтраховаяПрограмма,
	|	СУММА(омг_НоменклатураПриема.Количество) КАК Количество,
	|	омг_НоменклатураПриема.Регистратор.ДокументОснование КАК РегистраторДокументОснование,
	|	ЛОЖЬ КАК Исп
	|ИЗ
	|	РегистрСведений.омг_НоменклатураПриема КАК омг_НоменклатураПриема
	|ГДЕ
	|	омг_НоменклатураПриема.ДатаРегистрации МЕЖДУ &ДатаНачала И &ДатаОкончания"
	+ТекстДопУсловий3+
	"
	|СГРУППИРОВАТЬ ПО
	|	омг_НоменклатураПриема.Клиент,
	|	омг_НоменклатураПриема.Филиал,
	|	омг_НоменклатураПриема.Номенклатура,
	|	омг_НоменклатураПриема.Врач,
	|	омг_НоменклатураПриема.Регистратор.Ссылка,
	|	омг_НоменклатураПриема.омг_СтраховаяПрограмма,
	|	омг_НоменклатураПриема.Регистратор.ДокументОснование";
	
	Возврат Текст;     
	
КонецФункции
